"""1. Создайте lambda-функцию, которая возвращает квадрат числа."""
# a = lambda x: x * x
# print(a(10))


"""2. Создайте lambda-функцию, которая проверяет, является ли число четным."""
# func = lambda x: x % 2 == 0
# print(func(11))
# print(func(24))


"""3. Используйте lambda в sorted(), чтобы отсортировать список строк по последней букве.
Пример вызова:
words = ["banana", "apple", "cherry"]
print(sort_by_last_letter(words))
Ожидаемый результат:
['banana', 'apple', 'cherry']"""
# words = ["banana", "apple", "cherry"]
# result = sorted (words, key = lambda word: word[-1])
# print(result)

