"""1. Пройти по списку с помощью итератора
Создайте итератор для списка и выведите все его элементы с использованием next()."""
cities = ['Москва', 'Санкт-Петербург', 'Нижний Новгород', 'Уфа', 'Екатеринбург', 'Челябинск', 'Иркутск']
it_cities = iter(cities)
print(next(it_cities))
print(next(it_cities))
print(next(it_cities))
print(next(it_cities))
print(next(it_cities))
print(next(it_cities))
print(next(it_cities))


"""2. Итератор для строки
Используйте iter() и next() для посимвольного вывода строки."""
string = 'Automation'
it_str = iter(string)
print(next(it_str))
print(next(it_str))
print(next(it_str))
print(next(it_str))
print(next(it_str))
print(next(it_str))
print(next(it_str))
print(next(it_str))
print(next(it_str))
print(next(it_str))
